using Core.Domain;

namespace Core;

public static class SampleData
{
    public static List<Book> Books() =>
    [
        Book.Create("B-001", "978-6177730162", "Розум вбивці", 2018, "Майк Омер"),
        Book.Create("B-002", "978-6177730414", "У пітьмі", 2019, "Майк Омер"),
        Book.Create("B-003", "978-6177730728", "Густіше за кров", 2020, "Майк Омер"),

        Book.Create("B-004", "978-6177965311", "Клуб убивств по четвергах", 2020, "Річард Осман"),
        Book.Create("B-005", "978-6178012670", "Людина, яка померла двічі", 2021, "Річард Осман"),
        Book.Create("B-006", "978-6178222161", "Куля, що не влучила", 2022, "Річард Осман"),
        Book.Create("B-007", "978-6178222444", "Останній демон", 2023, "Річард Осман"),
        Book.Create("B-008", "978-0241992418", "Неможлива удача", 2025, "Річард Осман"),

        Book.Create("B-009", "978-6171241120", "Хімія смерті", 2006, "Саймон Бекетт"),
        Book.Create("B-010", "978-6171250559", "Записано на кістках", 2007, "Саймон Бекетт"),
        Book.Create("B-011", "978-6171263115", "Шепіт мертвих", 2009, "Саймон Бекетт"),
        Book.Create("B-012", "978-6171276856", "Поклик з могили", 2010, "Саймон Бекетт"),
        Book.Create("B-013", "978-6171289191", "Невгамовні мерці", 2017, "Саймон Бекетт"),
        Book.Create("B-014", "978-6171295833", "Запах смерті", 2019, "Саймон Бекетт"),

        Book.Create("B-015", "978-9661491761", "Убивства за абеткою", 1936, "Аґата Крісті"),
        Book.Create("B-016", "978-9661491754", "Вбивство у Східному експресі", 1934, "Аґата Крісті"),
        Book.Create("B-017", "978-9661491778", "Смерть на Нілі", 1937, "Аґата Крісті"),

        Book.Create("B-018", "978-9662355710", "Осина фабрика", 1984, "Ієн Бенкс"),

        Book.Create("B-019", "978-9661491785", "Етюд у багряних тонах", 1887, "Артур Конан Дойл"),
        Book.Create("B-020", "978-9660370906", "Знак чотирьох", 1890, "Артур Конан Дойл"),
        Book.Create("B-021", "978-9660370890", "Собака Баскервілів", 1902, "Артур Конан Дойл"),
        Book.Create("B-022", "978-9660371002", "Долина жаху", 1915, "Артур Конан Дойл")
    ];
}